app/controllers/pokes_controller.rb

SELECT * FROM "pokerizes" ORDER BY poked_at DESC
---
  def index
    @pokes = Pokerize.all :order => "poked_at DESC"